---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotOffsetRail
source: html/c6f884ae-db15-0c88-2eb5-5d76da734649.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotOffsetRail Property

Can't create one or more Rails with desired offset

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotOffsetRail { get; }
```